flowOverHills/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1159;

boundaryField
{
    inlet
    {
	type            cyclic;
    }

    outlet
    {
	type            cyclic;
    }

    wall
    {
	type            kqRWallFunction;
	value           uniform 0.1159;
    }

    frontAndBackPlanes
    {
	type            empty;
    }


}


// ************************************************************************* //
