flowOverHills/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(

    inlet
    {
        type            cyclic;
        nFaces          150;
        startFace       84766;
	neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        nFaces          150;
        startFace       84916;
	neighbourPatch  inlet;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          568;
        startFace       85066;
    }
    frontAndBackPlanes
    {
        type            empty;
        inGroups        1(empty);
        nFaces          85200;
        startFace       85634;
    }
)

// ************************************************************************* //
