flowOverHills/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                      GAMG;
        tolerance                   1e-6;
        relTol                      0.01;
        smoother                    GaussSeidel;
    }

    "(U|k|epsilon|omega|f|v2)"
    {
        solver                      smoothSolver;
        smoother                    symGaussSeidel;
        tolerance                   1e-6;
        relTol                      0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent      yes;

    residualControl
    {
        p               1e-5;
        U               1e-5;
        "(k|epsilon|omega|f|v2)" 1e-5;
    }

    pRefCell            0;
    pRefValue           0;
}

relaxationFactors
{
    fields
    {
        p               0.6;
    }
    equations
    {
        U               0.8;
        k               0.5;
        epsilon         0.5;
        omega           0.5;
    }
}


// ************************************************************************* //
